app/controllers/finanzs_controller.rb

SELECT "finanzs".* FROM "finanzs"
---
  def index
    @finanzs = Finanz.all

SELECT "finanzs".* FROM "finanzs" WHERE "finanzs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @finanz = Finanz.find(params[:id])

SELECT "finanzs".* FROM "finanzs" WHERE "finanzs"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @finanz = Finanz.find(params[:id])

INSERT INTO "finanzs" ("Datum", "Title", "Wert", "Zahlungstyp", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @finanz = Finanz.new(params[:finanz])

    respond_to do |format|
      if @finanz.save

SELECT "finanzs".* FROM "finanzs" WHERE "finanzs"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "finanzs" SET "Zahlungstyp" = 'Abbuchung', "updated_at" = '2013-01-14 15:22:18.296439' WHERE "finanzs"."id" = 2
---
  def update
    @finanz = Finanz.find(params[:id])

    respond_to do |format|
      if @finanz.update_attributes(params[:finanz])

SELECT "finanzs".* FROM "finanzs" WHERE "finanzs"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "finanzs" WHERE "finanzs"."id" = ?  [["id", 1]]
---
  def destroy
    @finanz = Finanz.find(params[:id])
    @finanz.destroy